[
  {
    "image": "https://i.ibb.co.com/NgDKLTYv/instagram.webp",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "Instagram is one of the world’s most popular social media platforms, designed to help people share life’s moments visually. Users can post photos and videos, create engaging Reels, and share stories that disappear after 24 hours. The app includes tools for filters, editing, and adding music to content, allowing creative expression at any level. Beyond personal sharing, Instagram serves as a hub for influencers, creators, and businesses to grow audiences through its explore page and algorithm-driven recommendations. It also supports direct messaging, live streaming, and shopping features, connecting users with brands and communities globally. Whether you're following friends, exploring trends, or discovering art, Instagram blends creativity and communication in one intuitive platform, all while maintaining a focus on visual storytelling and authentic connections.",
    "size": "150MB",
    "reviews": "12M",
    "ratingAvg": 4.8,
    "downloads": "1.4B",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 9000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YT4QbG8B/YouTube.jpg",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 2,
    "description": "YouTube is the world’s largest video-sharing platform, offering a vast universe of entertainment, education, and creativity. Users can watch millions of videos across countless categories including music, gaming, vlogs, news, and tutorials. With its personalized recommendations and powerful search engine, YouTube makes discovering new content seamless. Creators can upload and monetize their videos, build audiences, and connect directly with viewers through comments and live streams. YouTube also supports subscriptions, playlists, and memberships, helping users organize and follow their favorite channels. The app enables offline downloads, background play, and access to YouTube Premium for an ad-free experience. From learning new skills to enjoying viral trends, YouTube is the digital stage where the world watches and creates together.",
    "size": "125MB",
    "reviews": "23M",
    "ratingAvg": 4.7,
    "downloads": "2B",
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 18000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/GmJLxgL/spanchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 3,
    "description": "Snapchat is a multimedia messaging app that revolutionized the way people communicate visually. Known for its disappearing photos and videos, it encourages authentic and spontaneous sharing between friends. Users can apply filters, lenses, and augmented reality effects to personalize snaps and stories. The platform also includes Snap Map for sharing locations, Discover for exploring trending content, and Spotlight for showcasing creative videos to a global audience. Snapchat has grown into a space where self-expression meets technology, enabling users to stay connected while having fun. Its privacy-first design makes it unique, ensuring moments are temporary but memorable. From chatting with Bitmojis to exploring AR experiences, Snapchat delivers fast, visual, and dynamic interactions for the modern generation.",
    "size": "85MB",
    "reviews": "9.6M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 120000 },
      { "name": "2 star", "count": 220000 },
      { "name": "3 star", "count": 480000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 8500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/R4hmDtT8/whatsApp.webp",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 4,
    "description": "WhatsApp Messenger is a secure, fast, and easy-to-use communication platform connecting billions worldwide. It allows users to send text messages, voice notes, photos, and videos instantly, with end-to-end encryption ensuring privacy and safety. Users can make high-quality voice and video calls, both one-on-one and in groups, across devices and networks. WhatsApp supports group chats, broadcast lists, and file sharing, making it ideal for both personal and professional communication. Its WhatsApp Web and Business versions extend functionality to desktops and enterprises. With no ads or fees, WhatsApp focuses on reliable messaging and privacy. Whether staying in touch with family or collaborating with teams, it remains one of the world’s most trusted messaging platforms.",
    "size": "100MB",
    "reviews": "15M",
    "ratingAvg": 4.8,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/20pNpp1T/Spotify.png",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "id": 5,
    "description": "Spotify is the world’s leading music and podcast streaming platform, offering instant access to millions of tracks from artists across the globe. Users can create playlists, explore curated recommendations, and enjoy personalized mixes powered by advanced AI. Whether you’re discovering new artists or listening offline, Spotify delivers high-quality sound and seamless performance. The app also features podcasts, audiobooks, and radio-like stations to suit every mood and moment. Premium users enjoy ad-free listening, unlimited skips, and offline downloads. Spotify’s blend of personalization, discovery, and simplicity makes it an essential app for music lovers, empowering users to connect with sound and stories that move them every day.",
    "size": "130MB",
    "reviews": "8.5M",
    "ratingAvg": 4.6,
    "downloads": "4B",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 6800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/JwQmfbtM/TikTok.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 6,
    "description": "TikTok is a short-form video platform that has transformed how people create and consume content. Users can record, edit, and share videos up to several minutes long with built-in effects, filters, and background music. It’s a space where creativity meets global trends — from dance challenges to educational tutorials and comedy sketches. The app’s powerful recommendation algorithm personalizes the feed based on user interaction, making it highly engaging and addictive. TikTok also serves as a launchpad for influencers and small creators, giving them global visibility overnight. Users can duet, stitch, and interact directly through comments and live sessions. With billions of downloads, TikTok has become a cultural phenomenon, shaping entertainment, marketing, and even social discourse in the modern digital world.",
    "size": "120MB",
    "reviews": "20M",
    "ratingAvg": 4.7,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": 220000 },
      { "name": "2 star", "count": 350000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2600000 },
      { "name": "5 star", "count": 15000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/b4zzvVw/netflix.webp",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 7,
    "description": "Netflix is the world’s leading streaming platform, offering unlimited access to movies, TV series, documentaries, and award-winning original content. With an ever-expanding catalog across genres, users can enjoy personalized recommendations powered by viewing history and preferences. Netflix allows users to download content for offline viewing, adjust playback quality, and create individual profiles for each family member. The platform’s original productions — from blockbuster shows to indie films — have redefined entertainment on demand. It’s available on nearly every device, from smartphones to smart TVs, ensuring seamless cross-device access. Netflix continues to innovate with interactive storytelling, multi-language dubbing, and adaptive streaming technology, making it the go-to destination for high-quality, ad-free entertainment anytime, anywhere.",
    "size": "200MB",
    "reviews": "10M",
    "ratingAvg": 4.4,
    "downloads": "2B",
    "ratings": [
      { "name": "1 star", "count": 180000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 2400000 },
      { "name": "5 star", "count": 6700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLNrjcCb/google-Maps.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 8,
    "description": "Google Maps is a comprehensive navigation and mapping service that helps millions travel smarter every day. With real-time GPS navigation, traffic updates, and route planning, it ensures efficient travel whether driving, walking, cycling, or using public transport. The app includes street-level imagery, satellite views, and local business information with reviews and ratings. Google Maps also supports offline map downloads, making it reliable in areas with limited connectivity. Beyond navigation, it helps users explore restaurants, landmarks, and attractions nearby. Businesses use it for listings, delivery routes, and customer engagement. Its integration with Google Search, Assistant, and Calendar enhances productivity and convenience. Google Maps has become an essential companion for everyday navigation and exploration around the world.",
    "size": "140MB",
    "reviews": "11M",
    "ratingAvg": 4.7,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 8000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wNjTY4Xw/Gmail.webp",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 9,
    "description": "Gmail is Google’s free, secure, and reliable email service used by billions of people worldwide. It offers an intuitive interface with smart organization features such as automatic filtering of promotions, social updates, and important emails. Gmail integrates seamlessly with other Google Workspace tools like Drive, Calendar, and Meet, creating a powerful productivity ecosystem. Users benefit from AI-powered spam protection, search suggestions, and priority inbox features that simplify communication. It supports multiple accounts, offline mode, and advanced synchronization across devices. With powerful security, including two-step verification and encryption, Gmail ensures both privacy and reliability. Whether for personal correspondence or professional use, Gmail remains the cornerstone of modern digital communication, providing fast, efficient, and organized email management.",
    "size": "90MB",
    "reviews": "9M",
    "ratingAvg": 4.5,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 180000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 6800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/1tGpf7y9/Zoom-Cloud-Meetings.png",
    "title": "Zoom Cloud Meetings",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 10,
    "description": "Zoom Cloud Meetings is a leading video conferencing application that brings people together virtually with high-quality video, audio, and collaboration tools. It supports online meetings, webinars, and virtual events with features like screen sharing, breakout rooms, and real-time chat. Zoom’s intuitive interface makes it ideal for professionals, educators, and families alike. The platform ensures strong encryption for privacy and stability, even in low-bandwidth environments. It integrates with popular tools like Google Calendar and Microsoft Outlook, simplifying scheduling and collaboration. From remote work to online education, Zoom has redefined communication across industries, enabling seamless connectivity across devices. Its reliability and scalability make it one of the most trusted platforms for modern digital communication.",
    "size": "110MB",
    "reviews": "7M",
    "ratingAvg": 4.3,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 80000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 5300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/MxrsxWCd/Slack.webp",
    "title": "Slack",
    "companyName": "Slack Technologies, Inc.",
    "id": 11,
    "description": "Slack is a team collaboration and messaging platform that streamlines workplace communication. It organizes conversations into channels, enabling transparent discussions across departments and projects. Users can send direct messages, share files, integrate third-party apps, and automate workflows with ease. Slack’s search and archive features make it simple to find past messages and documents. It supports voice and video calls, screen sharing, and custom notifications, ensuring seamless teamwork whether in the office or remotely. The platform integrates with tools like Google Drive, Trello, and GitHub to centralize productivity. Slack enhances collaboration by keeping communication contextual and organized, making it a cornerstone of modern digital teamwork and project management.",
    "size": "95MB",
    "reviews": "3M",
    "ratingAvg": 4.4,
    "downloads": "600M",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 2050000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zh2nvDJt/Microsoft-Teams.png",
    "title": "Microsoft Teams",
    "companyName": "Microsoft Corporation",
    "id": 12,
    "description": "Microsoft Teams is a comprehensive communication and collaboration tool built for the modern workplace. It combines chat, video meetings, file sharing, and app integration into a single platform. Teams enhances productivity by bringing together Word, Excel, and PowerPoint integration directly within conversations. Users can schedule meetings, host webinars, and collaborate in real-time from any device. Its advanced features like breakout rooms, whiteboard, and background effects make remote collaboration seamless. With enterprise-grade security and compliance, it’s trusted by organizations worldwide. Whether for education, business, or hybrid work, Microsoft Teams fosters efficient communication, helping teams stay connected, organized, and productive in today’s digital environment.",
    "size": "120MB",
    "reviews": "4M",
    "ratingAvg": 4.2,
    "downloads": "800M",
    "ratings": [
      { "name": "1 star", "count": 70000 },
      { "name": "2 star", "count": 130000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1100000 },
      { "name": "5 star", "count": 2400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vCWxdNkz/Dropbox.webp",
    "title": "Dropbox",
    "companyName": "Dropbox, Inc.",
    "id": 13,
    "description": "Dropbox is a leading cloud storage and file synchronization service designed to simplify digital file management. It allows users to store, share, and access documents, photos, and videos securely across all devices. With automatic backups, version history, and offline access, Dropbox ensures your data is safe and always available. The platform integrates with tools like Microsoft Office, Google Workspace, and Slack, enhancing productivity for individuals and teams. Shared folders and real-time collaboration features make working together effortless. Dropbox also offers password management, file recovery, and smart organization powered by AI. It remains one of the most reliable and user-friendly cloud storage services, empowering people to stay organized and connected wherever they work.",
    "size": "85MB",
    "reviews": "2.2M",
    "ratingAvg": 4.3,
    "downloads": "800M",
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 160000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 1400000 }
    ]
  }
]
